#include<stdio.h>

int main()
{
	int fac[11] = {1,1,2,6,24,120,720,5040,40320,362880,3628800};
	int N,i;
	
	while (scanf("%d",&N) != EOF)
	{
		if (N < 0)
		{
			return 0;
		}
		else if (N == 0)
		{
			printf("NO\n");
		}
		else if (N > 0)
		{
			for (i = 9; i >= 0; i--)
				if (N >= fac[i])
					N -= fac[i];
			
			if (N == 0)
				printf("YES\n");
			else
				printf("NO\n");
		}
	}
	return 0;
}
/*
正确性:
一个小结论:n! >= sum(i!)(0<=i<=n-1)
证明:n! == n*(n-1)! >=sum(i!)(0 <= i <= n-1)
这个结论在下面可以用到.
从大到小考虑每个数的阶乘:
如果n < i!,那么把i!忽略;
如果n >= i!,那么i!必须选,如果不选,那么剩下的数的阶乘之和必然小于或等于i!,也必然小于n.选了i!之后,剩下的数就是n-i!,重复前面的过程,直到剩下的数为0.
要考虑的特殊情况:n == 0时答案应该为NO,因为题目要求至少表示成为一个数的阶乘之和.
陷阱:题目说输入是以负数结束,不要受样例误导,认为这个数是-1.
由于10! = 362880 > 1000000,所以只需要考虑10以内的阶乘就可以了.
*/
